04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleFluid/waveSubSurface/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [velocity];

internalField
{
    type        waveVelocity;
    libs        ("libwaves.so");
}

boundaryField
{
    bottom
    {
        type            noSlip;
    }

    "(top|inlet)"
    {
        type            waveVelocity;
        libs            ("libwaves.so");
    }

    outlet
    {
        type            pressureInletOutletVelocity;
    }

    "(front|back)"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
